# Напишите функцию summa_n, которая принимает одно целое положительное t число и находит сумму всех
# чисел от 1 до t включительно.
# Программа должна распечатать сообщение
# "Я знаю, что сумма чисел от 1 до {t} равна {S}", где в качестве t и S вам необходимо подставить значения
# (см. тестовые данные)
# Ваша задача написать только определение функции summa_n, вызывать ее не нужно

# def summa_n(t):
#     summa = 0
#     for i in range(1, t+1):
#         summa += i
#     print(f'Я знаю, что сумма чисел от 1 до {t} равна {summa}')

# -------------------------------------------------------------------

# Напишите функцию sum_num для суммирования всех цифр строки.
# Функция должна принимать строку, суммировать все ее символы, которые являются цифрами,
# и в качестве ответа выводить найденную сумму.

# ff= 'sdf'
# def sum_num(text):
#     summa = 0
#     for i in text:
#         if i.isdigit():
#             summa += i
#     print(summa)
